import 'package:hudra/model/reference_model.dart';

List<int> bRowList = [
  1,
  2,
  3,
  4,
  6,
  7,
  1,
  2,
  4,
  5,
  6,
  7,
  2,
  3,
  4,
  5,
  7,
  1,
  2,
  3,
  5,
  6,
  7,
  1,
  3,
  4,
  5,
  6
];

Map<int, List<int>> arkamAsasElSana = {
  5: [1, 2, 3, 4],
  3: [6, 7, 1, 2],
  1: [4, 5, 6, 7],
  6: [2, 3, 4, 5],
  4: [7, 1, 2, 3],
  2: [5, 6, 7, 1],
  7: [3, 4, 5, 6],
};

Map<int, dynamic> maraje3AlKiyama = {
  1: {
    "first": 25,
    "last": 1,
  },
  2: {
    "first": 13,
    "last": 6,
  },
  3: {
    "first": 2,
    "last": 2,
  },
  4: {
    "first": 22,
    "last": 5,
  },
  5: {
    "first": 10,
    "last": 3,
  },
  6: {
    "first": 30,
    "last": 6,
  },
  7: {
    "first": 18,
    "last": 4,
  },
  8: {
    "first": 7,
    "last": 7,
  },
  9: {
    "first": 27,
    "last": 3,
  },
  10: {
    "first": 15,
    "last": 1,
  },
  11: {
    "first": 4,
    "last": 4,
  },
  12: {
    "first": 24,
    "last": 7,
  },
  13: {
    "first": 12,
    "last": 5,
  },
  14: {
    "first": 1,
    "last": 1,
  },
  15: {
    "first": 21,
    "last": 4,
  },
  16: {
    "first": 9,
    "last": 2,
  },
  17: {
    "first": 29,
    "last": 5,
  },
  18: {
    "first": 17,
    "last": 3,
  },
  19: {
    "first": 6,
    "last": 6,
  },
};

Map<int, String> listOfMonths = {
  1: "January",
  2: "February",
  3: "March",
  4: "April",
  5: "May",
  6: "June",
  7: "July",
  8: "August",
  9: "September",
  10: "October",
  11: "November",
  12: "December",
};

Map<String, int> listOfArkamElBa3outh = {
  "normalYear": 21,
  "leapYear": 22,
};

Map<String, int> listOfAlSomAlKabir = {
  "normalYear": 10,
  "leapYear": 11,
};

final List<dynamic> holidaysNames = [
  {"en": "", "ar": "", "syr": ""},
  // {"en": "Sundays after Nativity", "ar": "آحاد بعد الميلاد", "syr": "ܚܕܒܫܒ̈ܐ ܕܒܬܪ ܝܠܕܐ"},//+added//
  {
    //1
    "en": "Sundays after Nativity",
    "ar": "آحاد بعد الميلاد",
    "syr": "ܚܕܒܫܒ̈ܐ ܕܒܬܪ ܝܠܕܐ"
  },
  //+added//
  {
    //2
    "en": "Advent", "ar": "سابوع البشارة", "syr": "ܣܘܒܪܐ"
  },
  {
    //3
    "en": "Epiphany", "ar": "سابوع الدنح", "syr": "ܕܢܚܐ0"
  },
  {
    //4
    "en": "Lent", "ar": "سابوع الصوم الكبير", "syr": "ܨܘܡܐ ܪܒܐ"
  },
  {
    //5
    "en": "Resurrection", "ar": "سابوع القيامة", "syr": "ܩܝܡܬܐ"
  },
  {
    //6
    "en": "Apostles", "ar": "سابوع الرسل", "syr": "ܫܠܝ̈ܚܐ"
  },
  {
    //7
    "en": "Summer", "ar": "سابوع الصيف", "syr": "ܩܝܛܐ"
  },
  {
    //8
    "en": "Elijah – Holy Cross",
    "ar": "سابوع إيليا والصليب",
    "syr": "ܐܠܝܐ - ܨܠܝܒܐ"
  },
  {
    //9
    "en": "Moses", "ar": "سابوع موسى", "syr": "ܡܘܫܐ"
  },
  {
    //10
    "ar": "سابوع تقديس الكنيسة",
    "en": "Sanctification of the Church",
    "syr": "ܩܘܕܫ ܥܕܬܐ - ܡܥܠܬܐ"
  },
  {
    //11
    "ar": "تذكار مار يوحنا المعمدان",
    "en": "Memory of Saint John the Baptist",
    "syr": " ܕܘܟܪܢܐ ܕܡܪܝ ܝܘܚܢܢ ܡܥܡܕܢܐ"
  },
  {
    //12
    "ar": "تذكار الرسولين مار بطرس ومار بولس",
    "en": "Memory of Saints Peter and Paul",
    "syr": " ܕܘܟܪܢܐ ܕܡܪܝ ܦܛܪܘܣ ܘܦܘܠܘܣ"
  },
  // {
  //   "ar": "(ASYR) تذكار الرسولين مار بطرس ومار بولس",
  //   "en": "Memory of Saints Peter and Paul (ASYR)",
  //   "syr": "(ASYR) ܕܘܟܪܢܐ ܕܡܪܝ ܦܛܪܘܣ ܘܦܘܠܘܣ"
  // },
  {
    //13
    "ar": "تذكار الإنجيليين الأربعة",
    "en": "Memory of the Four Evangelists",
    "syr": " ܕܘܟܪܢܐ ܕܐܪܒܥܐ ܐܘܢܓܠܣܛ̈ܐ"
  },
  {
    //14
    "ar": "تذكار الشهيد مار أسطيفانوس",
    "en": "Memory of Saint Stephanus",
    "syr": " ܕܘܟܪܢܐ ܕܡܪܝ ܐܣܛܦܢܘܣ"
  },
  {
    //15
    "ar": "تذكار الآباء اليونان",
    "en": "Memory of the Greek teachers",
    "syr": " ܕܘܟܪܢܐ ܕܡܠܦܢ̈ܐ ܝܘܢܝ̈ܐ"
  },
  {
    //16
    "ar": "تذكار الملافنة السريان والرومان",
    "en": "Memory of the Syriac and Roman teachers",
    "syr": " ܕܘܟܪܢܐ ܕܡܠܦܢ̈ܐ ܣܘܪ̈ܝܝܐ ܘܪܗ̄ܘܡܝ̈ܐ"
  },
  {
    //17
    "ar": "تذكار شفيع الكنيسة المحلية",
    "en": "Memory of the local Saint Patron",
    "syr": " ܕܘܟܪܢܐ ܕܚܕ ܦܪܨܘܦܐ"
  },
  {
    //18
    "ar": "تذكار الشهداء الأربعين",
    "en": "Memory of the Forty Martyrs",
    "syr": " ܕܘܟܪܢܐ ܕܐܪܒܥܝܢ ܣܗ̈ܕܐ"
  },
  {
    //19
    "ar": "تذكار الموتى المؤمنين",
    "en": "Memory of the Dead Faithful",
    "syr": "ܥܪܘܒܬܐ ܕܡܘܕܝ̈ܢܐ"
  },
  {
    //20
    "ar": "تذكار القديسة بربارة",
    "en": "Memory of Saint Barbara",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܬܝ ܒܪܒܪܐ"
  },
  {
    //21
    "ar": "مار نيقلاوس",
    "en": "Memory of Saint Nicolas",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܢܝܩܠܘܣ"
  },
  {
    //22
    "ar": " تذكار العذراء المحبول بها بلا دنس",
    "en": "Memory of Immaculate Conception",
    "syr": "ܕܘܟܪܢܐ ܕܒܛܝܢܘܬ ܡܪܝܡ ܒܠܥܕ ܚܛܝܬܐ ܟܝܢܝܬܐ"
  },
  {
    //23
    "ar": "عيد ميلاد ربنا يسوع المسيح",
    "en": "Solemnity Nativity of the Lord",
    "syr": "ܥܐܕܐ ܩܕܝܫܐ ܕܝܠܕܗ ܕܡܪܢ"
  },
  {
    //24
    "ar": "عيد تهنئة مريم العذراء",
    "en": "Feast of the Glorification of the Virgin Mary",
    "syr": "ܥܐܕܐ ܕܡܛܒܬܢܘܬ ܝܠܕܬ ܐܠܗܐ ܡܪܝܡ"
  },
  {
    //25
    "ar": "تذكار قتل أطفال بيت لحم",
    "en": "Memory of the holy innocents",
    "syr": "ܕܘܟܪܢܐ ܕܩܛܠܐ ܕܝܠܘܕ̈ܐ"
  },
  {
    //26
    "ar": "عيد ختانة الرب",
    "en": "Feast of the circumcision of Jesus",
    "syr": "ܥܐܕܐ ܕܓܙܘܪܬܗ ܕܡܪܢ"
  },
  {
    //27
    "en": "Solemnity of Epiphany", "ar": "عيد الدنح", "syr": "ܥܐܕܐ ܕܕܢܚܐ"
  },
  {
    //28
    "ar": " تذكار مار أنطونيوس",
    "en": "Memory of Saint Anthony the Great",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܐܢܛܘܢܝܘܣ"
  },
  {
    //29
    "ar": "عيد دخول الرب إلى الهيكل",
    "en": "Feast of the entrance of Jesus to the temple",
    "syr": "ܥܐܕܐ ܕܡܥܠܬܗ ܕܡܪܢ ܠܗܝܟܠܐ"
  },
  {
    //30
    "ar": "تذكار مار كوركيس",
    "en": "Memory of Saint George",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܓܝܘܪܓܝܣ"
  },
  {
    //31
    "ar": " تذكار مريم العذراء حافظة الزروع",
    "en": "Memory of the Virgin Mary protector of the crops",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܬܝ ܡܪܝܡ ܡܛܠ ܢܛܝܪܘܬ ܙܪ̈ܥܐ"
  },
  {
    //32
    "ar": " تذكار زيارة مريم العذراء إلى اليصابات",
    "en": "Memory of the Visitation of the Virgin Mary to Elisabeth",
    "syr": "ܕܘܟܪܢܐ ܕܡܐܙܠܬܐ ܕܡܪܬܝ ܡܪܝܡ ܠܘܬ ܐܠܝܫܒܥ"
  },
  {
    //33
    "ar": " تذكار مار توما الرسول",
    "en": "Memory of Saint Thomas the Apostle",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܬܐܘܡܐ ܫܠܝܚܐ"
  },
  {
    //34
    "ar": "عيد تجلي الرب على جبل طابور",
    "en": "Solemnity of Transfiguration",
    "syr": "ܥܐܕܐ ܩܕܝܫܐ ܕܓܠܝܢܗ ܕܡܪܢ"
  },
  {
    //35
    "ar": "عيد انتقال العذراء إلى السماء",
    "en": "Feast of Assumption of the Virgin Mary to heaven",
    "syr": "ܥܐܕܐ ܕܫܘܢܝܐ ܕܡܪܬܝ ܡܪܝܡ"
  },
  {
    //36
    "ar": "عيد ولادة العذراء مريم",
    "en": "Feast of birthday of the Virgin Mary",
    "syr": "ܥܐܕܐ ܕܝܠܝܕܘܬܗ ܕܡܪܬܝ ܡܪܝܡ"
  },
  {
    //37
    "ar": "عيد الصليب المقدس",
    "en": "Solemnity of the Holy Cross",
    "syr": "ܥܐܕܐ ܕܨܠܝܒܐ ܩܕܝܫܐ"
  },
  {
    //38
    "ar": "عيد يسوع الملك",
    "en": "Solemnity of Jesus the King",
    "syr": "ܥܐܕܐ ܕܝܫܘܥ ܡܠܟܐ"
  },
  {
    //39
    "ar": "تذكار مار يعقوب المقطع",
    "en": "Memory of Saint James the Mutilated",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܝܥܩܘܒ ܡܦܣܩܐ"
  },
  {
    //40
    "ar": "عيد مار يوسف",
    "en": "Feast of Saint Joseph",
    "syr": "ܥܐܕܐ ܕܡܪܝ ܝܘܣܦ"
  },
  {
    //41
    "ar": "عيد بشارة مريم العذراء",
    "en": "Feast of the Annunciation of the Virgin Mary",
    "syr": "ܥܐܕܐ ܕܣܘܒܪܗ ܕܡܪܬܝ ܡܪܝܡ"
  },
  // {
  //   "ar": "عيد بشارة مريم العذراء (ASYR)",
  //   "en": "Feast of the Annunciation of the Virgin Mary (ASYR)",
  //   "syr": "ܥܐܕܐ ܕܣܘܒܪܗ ܕܡܪܬܝ ܡܪܝܡ (ASYR)"
  // },
  {
    //42
    "ar": "تذكار مار بثيون",
    "en": "Memory of Saint Pitheon",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܦܬܝܘܢ"
  },
  {
    //43
    "ar": "تذكار مارت شموني واولادها",
    "en": "Memory of Saint Shmoni and her sons",
    "syr": "ܕܘܟܪܢܐ ܕܫܡܘܢܝ ܘܕܒܢܝ̈ܗ"
  },
  {
    //44
    "ar": "تذكار مار ادي الرسول",
    "en": "Memory of Saint Adday the Apostle",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܐܕܝ ܫܠܝܚܐ"
  },
  {
    //45
    "ar": "عيد الصعود",
    "en": "Solemnity of Ascension",
    "syr": "ܥܐܕܐ ܩܕܝܫܐ ܕܣܘܠܩܗ ܕܡܪܢ"
  },
  {
    //46
    "ar": "عيد حلول الروح القدس",
    "en": "Solemnity of Pentecost",
    "syr": "ܥܐܕܐ ܕܦܢܛܝܩܘܣܛܐ"
  },
  {
    //47
    "en": "The Gold Friday", "ar": "جمعة الذهب", "syr": "ܥܪܘܒܬܐ ܕܕܗܒܐ"
  },
  {
    //48
    "ar": "عيد الجسد",
    "en": "Corpus Christi",
    "syr": "ܥܐܕܐ ܩܕܝܫܐ ܕܐܝܩܪ ܦܓܪܗ ܕܡܪܢ"
  },
  {
    //49
    "ar": "تذكار التلاميذ الاثنين والسبعون",
    "en": "Memory of the 72 disciples",
    "syr": "ܕܘܟܪܢܐ ܕܫܒܥܝܢ ܘܬܪܝܢ ܬܠܡܝܕ̈ܐ"
  },
  {
    //50
    "ar": "تذكار الرسل الاثني عشر",
    "en": "Memory of the 12 Apostles",
    "syr": "ܕܘܟܪܢܐ ܕܬܪܥܣܪ ܫܠܝܚ̈ܐ"
  },
  {
    //51
    "ar": "تذكار مار شمعون برصباعي",
    "en": "Memory of Saint Shimun Bar-Sabba’i",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܫܡܥܘܢ ܒܪܨܒ̈ܥܐ"
  },
  {
    //52
    "ar": "تذكار مار قورياقوس وامه يوليطي",
    "en": "Memory of Saint Ciriaco and his mother Yoliti",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܩܘܪܝܩܘܣ ܘܕܝܘܠܝܛܐ ܐܡܗ"
  },
  {
    //53
    "ar": "تذكار قلب يسوع الاقدس",
    "en": "Memory of the Sacred Heart of Jesus",
    "syr": "ܕܘܟܪܢܐ ܩܕܝܫܐ ܕܠܒܗ ܕܡܪܢ"
  },
  {
    //54
    "ar": "تذكار مريم العذراء ملكة السماء والأرض",
    "en": "Memory of the Virgin Mary Queen of heaven and earth",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܬܝ ܡܪܝܡ ܡܠܟܬܐ ܕܫܡܝܐ ܘܐܪܥܐ"
  },
  {
    //55
    "ar": "تذكار مار أفرام المعلم",
    "en": "Memory of Saint Ephrem the teacher",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܐܦܪܝܡ ܡܠܦܢܐ"
  },
  {
    //56
    "ar": "تذكار مريم العذراء أم المعونة الدائمة",
    "en": "Memory of the Virgin Mary of the perpetual help",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܬܝ ܡܪܝܡ ܐܡܐ ܕܥܘܕܪܢܐ ܐܡܝܢܐ"
  },
  {
    //57
    "ar": "تذكار مار ميخا النوهدري",
    "en": "Memory of Saint Mikha of Nohadra",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܡܝܟܐ ܕܢܘܗܕܪܐ"
  },
  {
    //58
    "ar": "اثنين الباعوثة",
    "en": "Monday of Ba’outha",
    "syr": "ܬܪܝܢܒܫܒܐ ܕܒܥܘܬܐ"
  },
  {
    //59
    "ar": "ثلاثاء الباعوثة",
    "en": "Tuesday of Ba’outha",
    "syr": "ܬܠܬܒܫܒܐ ܕܒܥܘܬܐ"
  },
  {
    //60
    "ar": "اربعاء الباعوثة",
    "en": "Wednesday of Ba’outha",
    "syr": "ܐܪܒܥܒܫܒܐ ܕܒܥܘܬܐ"
  },
  {
    //61
    "ar": "تذكار مريم العذراء في الشتاء",
    "en": "Feast of the Virgin Mary in winter",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܬܝ ܡܪܝܡ ܒܣܬܘܐ"
  },
  {
    //62
    "ar": "تذكار مريم العذراء في ايار",
    "en": "Feast of the Virgin Mary in May",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܬܝ ܡܪܝܡ  ܒܐܝܪ"
  },
  {
    //63
    "ar": "تذكار مريم العذراء في الصيف",
    "en": "Feast of the Virgin Mary in summer",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܬܝ ܡܪܝܡ ܒܩܝܛܐ"
  },
  {
    //64
    "ar": "جمعة المعترفين",
    "en": "Friday of the Martyrs",
    "syr": "ܥܪܘܒܬܐ ܕܡܘܕܝ̈ܢܐ"
  },
  {
    //65
    "ar": "تذكار مار ميخائيل رفيق الملائكة",
    "en": "Memory of Saint Michael Friend of the Angels",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܡܝܟܐܝܠ ܚܒܪܐ ܕܡܠܐܟܐ"
  },
  {
    //66
    "ar": "جمعة لعازر",
    "en": "Friday of Lazarus",
    "syr": "ܥܪܘܒܬܐ ܕܠܥܙܪ"
  },
  {
    //67
    "ar": "أحد السعانين المجيد",
    "en": "Palm Sunday",
    "syr": "ܥܐܕܐ ܫܒܝܚܐ ܕܐܘܫܥܢ̈ܐ"
  },
  {
    //68
    "ar": "خميس الفصح",
    "en": "Holy Thursday",
    "syr": "ܚܡܫܒܫܒܐ ܕܦܨܚܐ"
  },
  {
    //69
    "ar": "جمعة الآلام",
    "en": "Good Friday",
    "syr": "ܥܪܘܒܬܐ ܕܚܫܐ"
  },
  {
    //70
    "ar": "السبت الكبير",
    "en": "Holy Saturday",
    "syr": "ܫܒܬܐ ܪܒܬܐ"
  },
  {
    //71
    "ar": "الأحد الكبير لقيامة ربنا",
    "en": "Resurrection of Our Lord",
    "syr": "ܚܕܒܫܒܐ ܪܒܐ ܕܩܝܡܬܗ ܕܡܪܢ"
  },
  {
    //72
    "ar": "تذكار مار اوراها",
    "en": "Memory of Saint Awraha",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܐܒܪܗܡ"
  },
  {
    //73
    "ar": "تذكار مار يعقوب النصيبيني",
    "en": "Memory of Saint Jacob of Nisibis",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܝܥܩܘܒ ܕܢܨܝܒܝܢ"
  },
  {
    //74
    "ar": "تذكار مار ماري الرسول",
    "en": "Memory of Saint Mari the Apostle",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܡܐܪܝ ܫܠܝܚܐ"
  },
  {
    //75
    "ar": "تذكار مار قرداغ الشهيد",
    "en": "Memory of Saint Qardagh",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܩܪܕܓ ܣܗܕܐ"
  },
  {
    //76
    "ar": "تذكار مار فافا",
    "en": "Memory of Mar Papa",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܦܦܐ"
  },
  {
    //77
    "ar": "تذكار مار ايليا التشبيي",
    "en": "Memory of Saint Elijah the Tishbite",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܐܝܠܝܐ ܬܫܒܝܝܐ"
  },
  {
    //78
    "ar": "تذكار الربان هرمزد الفارسي",
    "en": "Memory of Rabban Hormizd the Persian",
    "syr": "ܕܘܟܪܢܐ ܕܪܒܢ ܗܘܪܡܝܙܕ ܥܓܡܝܐ"
  },
  {
    //79
    "ar": "تذكار مار اوجين ورفاقه",
    "en": "Memory of Saint Augin and his firneds",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܐܘܓܝܢ ܘܚܒ̈ܪܘܗܝ"
  },
  {
    //80
    "ar": "تذكار مارت شموني واولادها للآشوريين",
    "en": "Memory of Saint Shmoni and her sons for the Assyrians",
    "syr": "ܕܕܘܟܪܢܐ ܕܫܡܘܢܝ ܘܕܒܢܝ̈ܗ ܕܐܫܘܪܝ̈ܐ"
  },
  {
    //81
    "ar": "تذكار مار فنحاس",
    "en": "Memory of Saint Pinhas",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܦܝܢܚܣ"
  },
  {
    //82
    "ar": "تذكار مار أحا",
    "en": "Memory of Saint Aha",
    "syr": "ܕܘܟܪܢܐ ܕܡܪܝ ܐܚܐ"
  },
  {
    //83
    "en": "Elijah",
    "ar": "سابوع إيليا",
    "syr": "ܐܠܝܐ"
  },
  {
    //84
    "en": "Holy Cross",
    "ar": "والصليب",
    "syr": "ܨܠܝܒܐ"
  }
];

final List<dynamic> weeksNames = [
  {"en": "", "ar": "", "syr": ""},
  {"en": "Week 1", "ar": "الاسبوع ١", "syr": "ܫܒܬܐ ܐ"},
  {"en": "Week 2", "ar": "الاسبوع ٢", "syr": "ܫܒܬܐ ܒ"},
  {"en": "Week 3", "ar": "الاسبوع ٣", "syr": "ܫܒܬܐ ܓ"},
  {"en": "Week 4", "ar": "الاسبوع ٤", "syr": "ܫܒܬܐ ܕ"},
  {"en": "Week 5", "ar": "الاسبوع ٥", "syr": "ܫܒܬܐ ܗ"},
  {"en": "Week 6", "ar": "الاسبوع ٦", "syr": "ܫܒܬܐ ܘ"},
  {"en": "Week 7", "ar": "الاسبوع ٧", "syr": "ܫܒܬܐ ܙ"},
  {"en": "Week 8", "ar": "الاسبوع ٨", "syr": "ܫܒܬܐ ܚ"},
  {"en": "Week 9", "ar": "الاسبوع ٩", "syr": "ܫܒܬܐ ܛ"}
];

final List<dynamic> daysNames = [
  {"en": "", "ar": "", "syr": ""},
  {"en": "Monday", "ar": "الإثنين", "syr": "ܚܕܒܫܒܐ"},
  {"en": "Tuesday", "ar": "الثلاثاء", "syr": "ܬܪܝܢܒܫܒܐ"},
  {"en": "Wednesday", "ar": "الأربعاء", "syr": "ܬܠܬܒܫܒܐ"},
  {"en": "Thursday", "ar": "الخميس", "syr": "ܐܪܒܥܒܫܒܐ"},
  {"en": "Friday", "ar": "الجمعة", "syr": "ܚܡܫܒܫܒܐ"},
  {"en": "Saturday", "ar": "السبت", "syr": "ܥܪܘܒܬܐ"},
  {"en": "Sunday", "ar": "الأحَد", "syr": "ܫܒܬܐ"}
];

final List<dynamic> prayerTimeNames = [
  {"en": "", "ar": "", "syr": ""},
  {"en": "vespers", "ar": "صلاة العشيّة", "syr": "ܪܡܫܐ"},
  {"en": "satiety", "ar": "صلاة الشبع", "syr": "ܣܘܒܥܐ"},
  {"en": "night & sitting", "ar": "صلاة الليل والجلسة", "syr": "ܠܠܝܐ ܘܡܘܬܒܐ"},
  {"en": "vigil", "ar": "صلاة السهرة", "syr": "ܩܠ̈ܐ ܕܫܗܪܐ"},
  {"en": "matutine", "ar": "صلاة الصباح", "syr": "ܨܦܪܐ"},
  {"en": "ceasing", "ar": "صلاة الانقطاع  ", "syr": "ܩܘܛܥܐ"},
  {"en": "mid-day", "ar": "صلاة العدان", "syr": "ܥܕܢܐ"},
  {"en": "Holy Mass", "ar": "القداس الالهي", "syr": "ܐ̄ܪ̈ܙܐ ܐܠܗܝ̈ܐ"}
];

// final List arList = [
//   '',
//   "سابوع البشارة",
//   "تذكار مار يوحنا المعمدان",
//   "تذكار الرسولين مار بطرس ومار بولس",
//   "تذكار الإنجيليين الأربعة",
//   "تذكار الشهيد مار أسطيفانوس",
//   "تذكار الآباء اليونان",
//   "تذكار الملافنة السريان والرومان",
//   "تذكار شفيع الكنيسة المحلية",
//   "تذكار الشهداء الأربعين",
//   "تذكار الموتى المؤمنين",
//   "سابوع الصوم الكبير",
//   "سابوع القيامة",
//   "سابوع الرسل",
//   "سابوع الصيف",
//   "سابوع إيليا",
//   "سابوع موسى",
//   "سابوع تقديس الكنيسة",
//   "القديسة بربارة",
//   "مار نيقلاوس",
//   "عيد العذراء المحبول بها بلا دنس",
//   "عيد ميلاد ربنا يسوع المسيح",
//   "عيد تهنئة مريم العذراء",
//   "ذكرى قتل أطفال بيت لحم",
//   "ختانة الرب",
//   "عيد الدنح",
//   "مار أنطونيوس",
//   "دخول الرب إلى الهيكل",
//   "تذكار مار كوركيس",
//   "عيد حافظة الزروع",
//   "عيد زيارة العذراء إلى اليصابات",
//   "مار توما الرسول",
//   "عيد تجلي الرب على جبل طابور",
//   "عيد انتقال العذراء إلى السماء",
//   "عيد ولادة العذراء مريم",
//   "عيد الصليب المقدس",
//   "عيد يسوع الملك",
//   "مار يعقوب المقطع",
//   "عيد مار يوسف",
//   "عيد بشارة مريم العذراء",
//   "تذكار مار بثيون",
//   "تذكار مارت شموني واولادها",
//   "تذكار مار ادي الرسول",
//   "عيد الصعود",
//   "عيد حلول الروح القدس",
//   "جمعة الذهب",
//   "عيد الجسد",
//   "تذكار التلاميذ الاثنين والسبعون",
//   "تذكار الرسل الاثني عشر",
//   "تذكار مار شمعون برصباعي",
//   "تذكار مار قورياقوس وامه يوليطي",
//   "تذكار قلب يسوع الاقدس",
//   "تذكار مريم العذراء ملكة السماء والأرض",
//   "تذكار مار أفرام كبير المعلمين",
//   "تذكار مريم العذراء أم المعونة الدائمة",
//   "تذكار مار ميخا النوهدري",
//   "سابوع تقديس الكنيسة",
//   "صوم باعوثة نينوى",
// ];
// final List syrList = [
//   '',
//   "ܣܘܒܪܐ",
//   "ܝܘܚܢܢ ܡܥܡܕܢܐ",
//   "ܡܪܝ ܦܛܪܘܣ ܘܦܘܠܘܣ",
//   "ܐܪܒܥܐ ܐܘܢܓܠܣܛ̈ܐ",
//   "ܡܪܝ ܐܣܛܦܢܘܣ",
//   "ܡܠܦܢ̈ܐ ܝܘܢܝ̈ܐ",
//   "ܡܠܦܢ̈ܐ ܣܘܪ̈ܝܝܐ ܘܪܗ̄ܘܡܝ̈ܐ",
//   "ܚܕ ܦܪܨܘܦܐ",
//   "ܐܪܒܥܝܢ ܣܗ̈ܕܐ",
//   "ܕܡܘܕܝ̈ܢܐ",
//   "ܨܘܡܐ ܪܒܐ",
//   "ܩܝܡܬܐ",
//   "ܫܠܝ̈ܚܐ",
//   "ܩܝܛܐ",
//   "ܐܠܝܐ - ܨܠܝܒܐ",
//   "ܡܘܫܐ",
//   "ܩܘܕܫ ܥܕܬܐ - ܡܥܠܬܐ",
//   "ܕܘܟܪܢܐ ܕܡܪܬܝ ܒܪܒܪܐ",
//   "ܕܘܟܪܢܐ ܕܡܪܝ ܢܝܩܠܘܣ",
//   "ܕܘܟܪܢܐ ܕܒܛܝܢܘܬ ܡܪܝܡ ܒܠܥܕ ܚܛܝܬܐ ܟܝܢܝܬܐ",
//   "ܥܐܕܐ ܩܕܝܫܐ ܕܝܠܕܗ ܕܡܪܢ",
//   "ܥܐܕܐ ܕܡܛܒܬܢܘܬ ܝܠܕܬ ܐܠܗܐ ܡܪܝܡ",
//   "ܕܘܟܪܢܐ ܕܩܛܠܐ ܕܝܠܘܕ̈ܐ",
//   "ܥܐܕܐ ܕܓܙܘܪܬܐ ܕܡܪܢ",
//   "ܥܐܕܐ ܕܕܢܚܐ",
//   "ܕܘܟܪܢܐ ܕܡܪܝ ܐܢܛܘܢܝܘܣ",
//   "ܥܐܕܐ ܡܥܠܬܗ ܕܡܪܢ ܠܗܝܟܠܐ",
//   "ܕܘܟܪܢܐ ܕܡܪܝ ܓܝܘܪܓܝܣ",
//   "ܕܘܟܪܢܐ ܕܡܪܬܝ ܡܪܝܡ ܡܛܠ ܢܛܝܪܬܘ ܙܪ̈ܥܐ",
//   "ܕܘܟܪܢܐ ܕܡܐܙܠܬܐ ܕܡܪܬܝ ܡܪܝܡ ܠܘܬ ܐܠܝܫܒܥ",
//   "ܕܘܟܪܢܐ ܕܡܪܝ ܬܐܘܡܐ ܫܠܝܚܐ",
//   "ܥܐܕܐ ܩܕܝܫܐ ܕܓܠܝܢܗ ܕܡܪܢ",
//   "ܥܐܕܐ ܕܫܘܢܝܐ ܕܡܪܬܝ ܡܪܝܡ",
//   "ܥܐܕܐ ܕܝܠܝܕܘܬܗ ܕܡܪܬܝ ܡܪܝܡ",
//   "ܥܐܕܐ ܕܨܠܝܒܐ ܩܕܝܫܐ",
//   "ܥܐܕܐ ܕܝܫܘܥ ܡܠܟܐ",
//   "ܕܘܟܪܢܐ ܕܡܪܝ ܝܥܩܘܒ ܡܦܣܩܐ",
//   "ܥܐܕܐ ܕܡܪܝ ܝܘܣܦ",
//   "ܥܐܕܐ ܕܣܘܒܪܗ ܕܡܪܬܝ ܡܪܝܡ",
//   "ܕܘܟܪܢܐ ܕܡܪܝ ܦܬܝܘܢ",
//   "ܕܘܟܪܢܐ ܕܫܡܘܢܝ ܘܕܒܢܝܗ",
//   "ܕܘܟܪܢܐ ܕܡܪܝ ܐܕܝ ܫܠܝܚܐ",
//   "ܥܐܕܐ ܩܕܝܫܐ ܕܣܘܠܩܗ ܕܡܪܢ",
//   "ܥܐܕܐ ܕܦܢܛܝܩܘܣܛܐ",
//   "ܥܪܘܒܬܐ ܕܕܗܒܐ",
//   "ܥܐܕܐ ܩܕܝܫܐ ܕܐܝܩܪ ܦܓܪܗ ܕܡܪܢ",
//   "ܕܘܟܪܢܐ ܕܫܒܥܝܢ ܘܬܪܝܢ ܬܠܡܝܕ̈ܐ",
//   "ܕܘܟܪܢܐ ܕܬܪܥܣܪ ܫܠܝܚ̈ܐ",
//   "ܕܘܟܪܢܐ ܕܡܪܝ ܫܡܥܘܢ ܒܪܨܒ̈ܥܐ",
//   "ܕܘܟܪܢܐ ܕܡܪܝ ܩܘܪܝܩܘܣ ܘܕܝܘܠܝܛܐ ܐܡܗ",
//   "ܕܘܟܪܢܐ ܩܕܝܫܐ ܕܠܒܗ ܕܡܪܢ",
//   "ܕܘܟܪܢܐ ܕܡܪܬܝ ܡܪܝܡ ܡܠܟܬܐ ܕܫܡܝܐ ܘܐܪܥܐ",
//   "ܕܘܟܪܢܐ ܕܡܪܝ ܐܦܪܝܡ ܡܠܦܢܐ",
//   "ܕܘܟܪܢܐ ܕܡܪܬܝ ܡܪܝܡ ܐܡܐ ܕܥܘܕܪܢܐ ܐܡܝܢܐ",
//   "ܕܘܟܪܢܐ ܕܡܪܝ ܡܝܟܐ ܕܢܘܗܕܪܐ",
//   "ܩܘܕܫ ܥܕܬܐ - ܡܥܠܬܐ",
//   "ܨܘܡܐ ܕܒܥܘܬܐ ܕܢܢܘܐ",
// ];
