Repository: JosephhBh/hudra_updated
Catalog: lib/l10n/app_*.arb
Languages: fa

source: Language
fa: ܠܫܢܐ

source: Daily
fa: ܝܘܡܐܝܬ

source: Calendar
fa: ܣܘܪܓܕܐ

# rituals
source: Rites
fa: ܛܟܣܐ

source: Bible
fa: ܟܬܒܐ ܩܕܝܫܐ

source: Settings
fa: ܛܘܟܣܐ

source: Share
fa: ܦܪܣܐ

source: Save
fa: ܢܛܪܐ

source: Verse of the day
fa: ܐܬܘܬܐ ܕܝܘܡܐ

# monday
source: Mo
fa: ܬܪܝܢ

# tuesday
source: Tu
fa: ܬܠܬ

# wednesday
source: We
fa: ܐܪܒܥ

# thursday
source: Th
fa: ܚܡܫ

# friday
source: Fr
fa: ܥܪܘܒܬܐ

# saturday
source: Sa
fa: ܫܒܬܐ

# sunday
source: Su
fa: ܚܕ

source: No holiday
fa: ܫܚܝܡܐ

source: Daily Verses
fa: ܐܬܘ̈ܬܐ ܕܝܘܡܐ

source: Full Calendar
fa: ܣܘܪܓܕܐ ܡܒܫܠܐ

source: Saved Verses
fa: ܐܬܘ̈ܬܐ ܢܛܝܪ̈ܬܐ

source: Dark Mode
fa: ܡܚܙܝܬܐ ܐܘܟܡܬܐ

source: General
fa: ܓܘܢܝܐ

source: Push Notifications
fa: ܢܘܗܪ̈ܐ ܦܘܫ

source: Prayers Language
fa: ܠܫܢܐ ܕܨܠܘ̈ܬܐ

source: Text Size
fa: ܓܘܫܡܐ ܕܟܬܒܬܐ

source: Size example
fa: ܡܬܠܐ ܕܓܘܫܡܐ

source: Book Mode
fa: ܕܘܡܝܐ ܕܟܬܒܐ

source: A
fa: أ

source: Holiday Prayer
fa: ܨܠܘ̈ܬܐ ܕܥܐܕ̈ܐ

source: Holidays
fa: ܥܐܕ̈ܐ

source: Discover
fa: ܒܚܘܪ

source: Notifications
fa: ܢܘܗ̈ܪܐ

source: Saved
fa: ܢܛܝܪ̈ܐ

source: Prayers
fa: ܨܠܘ̈ܬܐ

# sendNotification
source: Notification
fa: ܫܕܪ ܢܘܗܪ̈ܐ

# churchSyriac
source: Assyrian Church of the East
fa: ܥܕܬܐ ܕܡܕܢܚܐ ܕܐܬܘܪ̈ܝܐ

# churchChaldean
source: Chaldean Church
fa: ܥܕܬܐ ܟܠܕܝܬܐ

source: Select Verse
fa: ܓܒܝ ܐܬܘܬܐ

source: Title
fa: ܫܡܐ

source: Reference
fa: ܡܒܘܥܐ

source: Export Excel
fa: ܫܢܝ ܠܓܝܓܠܐ

source: Get all results
fa: ܦܢܝ ܥܩܒܐ

source: Start Year
fa: ܫܘܪܝܐ ܕܫܢ̄ܬܐ

source: End Year
fa: ܚܘܬܡܐ ܕܫܢ̄ܬܐ

source: Enter a title
fa: ܐܥܠ ܫܡܐ

source: Enter a message
fa: ܐܥܠ ܐܓܪܬܐ

source: Send
fa: ܫܕܪ

source: Prayer Name
fa: ܫܡܐ ܕܨܠܘܬܐ

source: Prayer Related Holiday
fa: ܨܠܘܬܐ ܕܥܐܕܐ

source: Prayer description
fa: ܙܢܐ ܕܨܠܘܬܐ

source: Prayers English
fa: ܨܠܘܬܐ ܒܐܢܓܠܝܙܝܐ

source: Prayers Arabic
fa: ܨܠܘܬܐ ܒܥܪܒܝܐ

source: Prayers Syriac
fa: ܨܠܘܬܐ ܒܣܘܪܝܝܐ

source: Bible English
fa: ܟܬܒܐ ܩܕܝܫܐ ܒܐܢܓܠܝܙܝܐ

source: Bible Arabic
fa: ܟܬܒܐ ܩܕܝܫܐ ܒܥܪܒܝܐ

source: Bible Syriac
fa: ܟܬܒܐ ܩܕܝܫܐ ܒܣܘܪܝܝܐ

source: Liturgical period
fa: ܫܒ̈ܘܥܐ

source: Days
fa: ܝܘܡ̈ܐ

source: Mattutines
fa: ܨܦܪܐ

source: Vespers
fa: ܪܡܫܐ

source: Choose Bible Language
fa: ܓܒܝ ܠܫܢܐ ܕܟܬܒܐ ܩܕܝܫܐ

source: Choose Prayers Language
fa: ܓܒܝ ܠܫܢܐ ܕܨܠܘ̈ܬܐ

source: Do you want to save changes before closing?
fa: ܨܒܐ ܐܢ̄ܬ ܠܡܛܪ ܫܘܚܠܦ̈ܐ ܩܕܡ ܕܬܦܘܩ؟

source: Yes
fa: ܐܝܢ

source: No
fa: ܠܐ

source: Prayer time
fa: ܥܕܢܐ ܕܨܠܘܬܐ

source: No data found
fa: لاتوجد بيانات
